In [1]:
import numpy as np
import pandas as pd

In [2]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [3]:
a=pd.read_csv('a.csv')

In [4]:
b=pd.read_csv('b.csv')

In [6]:
print(a)
print(b)

    A   B
0  10  20
1  30  40
    A   C
0  10  20
1  30  40

In [7]:
b

    A   C
0  10  20
1  30  40

In [8]:
pd.concat([a,b])  #simple stacking , not intelligent

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [9]:
pd.concat([a,b],axis=0)  #default is 0th axis

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [10]:
data=pd.concat([a,b],axis=1)

In [11]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [12]:
type(data)

pandas.core.frame.DataFrame

In [13]:
data.size

8

In [14]:
data.loc[:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [15]:
data.iloc[:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [16]:
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

In [17]:
pd.concat([a,b],axis=0,join='inner')    # will get the common coulmn

    A
0  10
1  30
0  10
1  30

In [18]:
pd.concat([a,b],axis=0,join='outer')   #outer will be default and it will give the union

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [19]:
a.merge(b)

    A   B   C
0  10  20  20
1  30  40  40